#მოსწავლეს შემოატანინეთ სკოლის ტესტში მიღებული ნიშანი, თუ ეს მიღებული ნიშანი უდრის 10 - ს, მაგ შემთხვევაში მასწავლებელმა, მშობელთან შეაქოს მოსწავლე, თუ მიღებული ნიშანი უდრის 8 -ს ან 9 - ს, მაგ შემთხვევაში, მასწავლებელმა, მშობელს პატარა შენიშვნა მისცეს. თუ მიღებული ქულა უდრის 5  - ს მაგ შემთხვევაში, მასწავლებელმა, მშობელს მისცეს შენიშვნა, ხოლო თუ მიღებული ნიშანი ნაკლებია 5 ზე, მაგ შემთხვევაში, მასწავლებელმა გააგდოს მოსწავლე სკოლიდან
score = int(input(" სკოლის ტესტში მიღებული ნიშანი :  "))

if score == 10:
    print( "მასწავლებელმა მშობელთან შეაქოს მოსწავლე ")
elif 8 <= score <= 9:
    print(" მასწავლებელმა მშობელს პატარა შენიშვნა მისცეს ")
elif score == 5:
    print(" მასწავლებელმა მშობელს მისცეს შენიშვნა ")
else:
    print(" მასწავლებელმა გააგდოს მოსწავლე სკოლიდან ")

# 1)ჩვენ როდესაც მნიშვნელობა პრინტს ვუშვებთ შემდეგ გვჭირდება ფრჩხილები და ვპრინტავთ მაგალითად ლიმონს.
#მაგ:print("lime")
# 2)გამოტანას აქვს წვდომა რაც ფრჩხილებშია მაგალითად სია .მაგ:print(output("list"))
# 3)მძიმე გამოიყენება სხვადასხვა წინადადებაში.










