print= "goateacher"
# ჩვენ გვაქვს მოცემული ცვლადი და გვინდა მისი მნიშვნელობა პრინტ ბრძანებით გამოვიტანოთ

nika)= "13 wlis"
nika= nika+1234567890
# ჩვენ გვაქვს ინტეჯერის ცვლადი და გვინდა დავუმატოთ მოცემული რიცხვი

demetre is best
# ჩვენ არ შექვიძლია ცვლადის სახელში გამოვიყენოთ სიტყვა space

age) = 13
age = age+1
# აქ კი გვაქვს ინტეჯერ ტიპის ცვლადი რომელსაც გვინდა დავუმატოთ მოცემულ რიცხვს

(forward,left,rigth)
# ჩვენ შეგვიძლია მათი გამოყენებით შევქმნათ სახლი

str(string)
# ეს ისეთი ცვლადია რომელშიც ბრჭყალებია გამოყენებული

my_name = "ნიკა"
# my_name არის ცვლადის სახელი
# ნიკა არის ცვლადის მნიშვნელობა
# = არის მიმნიჭებელი ოპერატორი








































