#არის რიცხვი რომელის უდრის 0-ს. ფუნქციას გადაეცემა string, სვლები, რომელიც შედგება '+' და '-' ისაგნ. '+' ნიშნავს რიცხვის ერთით გაზრდას, '-' ერთით შემცირებას. დააბრუნეთ სია, სადაც გამოიტანთ ყოველი სხვლის შემდეგ რიცხვის მნიშვენობას. f("+-++-+++-----+")=[1,0,1,2,1,2,3,4,3,2,1,0,-1,0]. ახსნა: თავიდან რიცხვი უდრის 0-ს. პირველი string-ის ელემენტია '+' რაც რიცხვს ხდის 1-ს. შემდეგი ელემტია '-', რაც რიცხვს ხდის 0-ს. ასე ვაგრძელებთ სიის შევსებას.
def track_number(steps: str):
    result = []
    number = 0
    for step in steps:
        if step == '+':
            number += 1
        elif step == '-':
            number -= 1
        result.append(number)
    return result
steps = "+-++-+++-----+"
print(track_number(steps))  